{"config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"sparse": false, "batch_input_shape": [null, 6, 128, 160, 1], "dtype": "float32", "name": "input_1"}, "name": "input_1"}, {"class_name": "ConvLSTM2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"go_backwards": false, "unit_forget_bias": true, "unroll": false, "implementation": 0, "dilation_rate": [1, 1], "name": "conv_lst_m2d_1", "strides": [2, 2], "kernel_size": [3, 3], "data_format": "channels_last", "bias_regularizer": null, "recurrent_constraint": null, "bias_constraint": null, "kernel_constraint": null, "recurrent_dropout": 0.0, "padding": "same", "stateful": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "kernel_regularizer": null, "recurrent_regularizer": null, "activation": "tanh", "return_state": false, "recurrent_activation": "hard_sigmoid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 20, "use_bias": true, "dropout": 0.0, "return_sequences": true, "activity_regularizer": null, "trainable": true}, "name": "conv_lst_m2d_1"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv_lst_m2d_1", 0, 0, {}]]], "config": {"name": "batch_normalization_1", "gamma_constraint": null, "scale": true, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "beta_constraint": null}, "name": "batch_normalization_1"}, {"class_name": "MaxPooling3D", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "config": {"pool_size": [1, 2, 2], "name": "max_pooling3d_1", "strides": [1, 2, 2], "data_format": "channels_last", "padding": "same", "trainable": true}, "name": "max_pooling3d_1"}, {"class_name": "ConvLSTM2D", "inbound_nodes": [[["max_pooling3d_1", 0, 0, {}]]], "config": {"go_backwards": false, "unit_forget_bias": true, "unroll": false, "implementation": 0, "dilation_rate": [1, 1], "name": "conv_lst_m2d_2", "strides": [2, 2], "kernel_size": [3, 3], "data_format": "channels_last", "bias_regularizer": null, "recurrent_constraint": null, "bias_constraint": null, "kernel_constraint": null, "recurrent_dropout": 0.0, "padding": "same", "stateful": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "kernel_regularizer": null, "recurrent_regularizer": null, "activation": "relu", "return_state": false, "recurrent_activation": "hard_sigmoid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 10, "use_bias": true, "dropout": 0.0, "return_sequences": true, "activity_regularizer": null, "trainable": true}, "name": "conv_lst_m2d_2"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv_lst_m2d_2", 0, 0, {}]]], "config": {"name": "batch_normalization_2", "gamma_constraint": null, "scale": true, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "beta_constraint": null}, "name": "batch_normalization_2"}, {"class_name": "MaxPooling3D", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "config": {"pool_size": [1, 3, 3], "name": "max_pooling3d_2", "strides": [1, 3, 3], "data_format": "channels_last", "padding": "same", "trainable": true}, "name": "max_pooling3d_2"}, {"class_name": "TimeDistributed", "inbound_nodes": [[["max_pooling3d_2", 0, 0, {}]]], "config": {"trainable": true, "layer": {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, "name": "time_distributed_1"}, "name": "time_distributed_1"}, {"class_name": "TimeDistributed", "inbound_nodes": [[["time_distributed_1", 0, 0, {}]]], "config": {"trainable": true, "layer": {"class_name": "Dense", "config": {"units": 512, "activation": "linear", "name": "dense_1", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}}, "name": "time_distributed_2"}, "name": "time_distributed_2"}, {"class_name": "TimeDistributed", "inbound_nodes": [[["time_distributed_2", 0, 0, {}]]], "config": {"trainable": true, "layer": {"class_name": "Dense", "config": {"units": 1, "activation": "sigmoid", "name": "dense_2", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}}, "name": "time_distributed_3"}, "name": "time_distributed_3"}], "output_layers": [["time_distributed_3", 0, 0]], "input_layers": [["input_1", 0, 0]], "name": "model_1"}, "keras_version": "2.1.2", "class_name": "Model", "backend": "tensorflow"}